Revit 2027 API
BuiltInFailures.SketchFailures.StairClosedBoundariesError Property
 Stairs Boundaries (chains of one or more Boundary Lines) should not form closed loops.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairClosedBoundariesError { get; }
Public Shared ReadOnly Property StairClosedBoundariesError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairClosedBoundariesError {
	FailureDefinitionId^ get ();
}
static member StairClosedBoundariesError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace